pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/eUSCI_B1_208.0.xml
    <register id="UCB1BRW_SPI" width="16" offset="0x6" internal="0" description="eUSCI_Bx Bit Rate Control Register 1">
    </register>
    <register id="UCB1STATW" width="16" offset="0x8" internal="0" description="eUSCI_Bx Status Register">
        <bitfield id="UCBBUSY" description="Bus busy" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="IDLE" value="0x0" description="Bus inactive"/>
            <bitenum id="BUSY" value="0x1" description="Bus busy"/>
        </bitfield>
        <bitfield id="UCGC" description="General call address received" begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="UCGC_0" value="0x0" description="No general call address received"/>
            <bitenum id="UCGC_1" value="0x1" description="General call address received"/>
        </bitfield>
        <bitfield id="UCSCLLOW" description="SCL low" begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="UCSCLLOW_0" value="0x0" description="SCL is not held low"/>
            <bitenum id="UCSCLLOW_1" value="0x1" description="SCL is held low"/>
        </bitfield>
        <bitfield id="UCBCNT" description="Hardware byte counter value" begin="15" end="8" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="UCB1STATW_SPI" width="16" offset="0x8" internal="0" description="">
        <bitfield id="UCOE" description="Overrun error flag" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="UCOE_0" value="0x0" description="No error"/>
            <bitenum id="UCOE_1" value="0x1" description="Overrun error occurred"/>
        </bitfield>
        <bitfield id="UCFE" description="Framing error flag" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="UCFE_0" value="0x0" description="No error"/>
            <bitenum id="UCFE_1" value="0x1" description="Bus conflict occurred"/>
        </bitfield>
        <bitfield id="UCLISTEN" description="Listen enable" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="UCLISTEN_0" value="0x0" description="Disabled"/>
            <bitenum id="UCLISTEN_1" value="0x1" description="Enabled. UCBxTXD is internally fed back to the receiver"/>
        </bitfield>
    </register>
    <register id="UCB1TBCNT" width="16" offset="0xA" internal="0" description="eUSCI_Bx Byte Counter Threshold Register">
        <bitfield id="UCTBCNT" description="Byte counter threshold value" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="UCB1RXBUF" width="16" offset="0xC" internal="0" description="eUSCI_Bx Receive Buffer Register">
        <bitfield id="UCRXBUF" description="Receive data buffer" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="UCB1RXBUF_SPI" width="16" offset="0xC" internal="0" description="eUSCI_Bx Receive Buffer Register">
        <bitfield id="UCRXBUF" description="Receive data buffer" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="UCB1TXBUF" width="16" offset="0xE" internal="0" description="eUSCI_Bx Transmit Buffer Register">
        <bitfield id="UCTXBUF" description="Transmit data buffer" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="UCB1TXBUF_SPI" width="16" offset="0xE" internal="0" description="eUSCI_Bx Transmit Buffer Register">
        <bitfield id="UCTXBUF" description="Transmit data buffer" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="UCB1I2COA0" width="16" offset="0x14" internal="0" description="eUSCI_Bx I2C Own Address 0 Register">
        <bitfield id="I2COA0" description="I2C own address" begin="9" end="0" width="10" rwaccess="R/W">
        </bitfield>
        <bitfield id="UCOAEN" description="Own Address enable register" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The slave address defined in I2COA0 is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="The slave address defined in I2COA0 is enabled"/>
        </bitfield>
        <bitfield id="UCGCEN" description="General call response enable" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="UCGCEN_0" value="0x0" description="Do not respond to a general call"/>
            <bitenum id="UCGCEN_1" value="0x1" description="Respond to a general call"/>
        </bitfield>
    </register>
    <register id="UCB1I2COA1" width="16" offset="0x16" internal="0" description="eUSCI_Bx I2C Own Address 1 Register">
        <bitfield id="I2COA1" description="I2C own address" begin="9" end="0" width="10" rwaccess="R/W">
        </bitfield>
        <bitfield id="UCOAEN" description="Own Address enable register" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The slave address defined in I2COA1 is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="The slave address defined in I2COA1 is enabled"/>
        </bitfield>
    </register>
    <register id="UCB1I2COA2" width="16" offset="0x18" internal="0" description="eUSCI_Bx I2C Own Address 2 Register">
        <bitfield id="I2COA2" description="I2C own address" begin="9" end="0" width="10" rwaccess="R/W">
        </bitfield>
        <bitfield id="UCOAEN" description="Own Address enable register" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The slave address defined in I2COA2 is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="The slave address defined in I2COA2 is enabled"/>
        </bitfield>
    </register>
    <register id="UCB1I2COA3" width="16" offset="0x1A" internal="0" description="eUSCI_Bx I2C Own Address 3 Register">
        <bitfield id="I2COA3" description="I2C own address" begin="9" end="0" width="10" rwaccess="R/W">
        </bitfield>
        <bitfield id="UCOAEN" description="Own Address enable register" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The slave address defined in I2COA3 is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="The slave address defined in I2COA3 is enabled"/>
        </bitfield>
    </register>
    <register id="UCB1ADDRX" width="16" offset="0x1C" internal="0" description="eUSCI_Bx I2C Received Address Register">
        <bitfield id="ADDRX" description="Received Address Register" begin="9" end="0" width="10" rwaccess="R">
        </bitfield>
    </register>
    <register id="UCB1ADDMASK" width="16" offset="0x1E" internal="0" description="eUSCI_Bx I2C Address Mask Register">
        <bitfield id="ADDMASK" description="Address Mask Register. By clearing the corresponding bit of the own address, this bit is a don't care when comparing the address on the bus to the own address. Using this method, it is possible to react on more than one slave address. When all bits of ADDMASKx are set, the address mask feature is deactivated. Modify only when UCSWRST = 1." begin="9" end="0" width="10" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="UCB1I2CSA" width="16" offset="0x20" internal="0" description="eUSCI_Bx I2C Slave Address Register">
        <bitfield id="I2CSA" description="I2C slave address" begin="9" end="0" width="10" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="UCB1IE" width="16" offset="0x2A" internal="0" description="eUSCI_Bx Interrupt Enable Register">
        <bitfield id="UCRXIE0" description="Receive interrupt enable 0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="UCRXIE0_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCRXIE0_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCTXIE0" description="Transmit interrupt enable 0" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="UCTXIE0_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCTXIE0_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCSTTIE" description="START condition interrupt enable" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="UCSTTIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCSTTIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCSTPIE" description="STOP condition interrupt enable" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="UCSTPIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCSTPIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCALIE" description="Arbitration lost interrupt enable" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="UCALIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCALIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCNACKIE" description="Not-acknowledge interrupt enable" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="UCNACKIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCNACKIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCBCNTIE" description="Byte counter interrupt enable" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="UCBCNTIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCBCNTIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCCLTOIE" description="Clock low timeout interrupt enable" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="UCCLTOIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCCLTOIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCRXIE1" description="Receive interrupt enable 1" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="UCRXIE1_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCRXIE1_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCTXIE1" description="Transmit interrupt enable 1" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="UCTXIE1_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCTXIE1_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCRXIE2" description="Receive interrupt enable 2" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="UCRXIE2_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCRXIE2_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCTXIE2" description="Transmit interrupt enable 2" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="UCTXIE2_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCTXIE2_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCRXIE3" description="Receive interrupt enable 3" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="UCRXIE3_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCRXIE3_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCTXIE3" description="Transmit interrupt enable 3" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="UCTXIE3_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCTXIE3_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCBIT9IE" description="Bit position 9 interrupt enable" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="UCBIT9IE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCBIT9IE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
    </register>
    <register id="UCB1IE_SPI" width="16" offset="0x2A" internal="0" description="eUSCI_Bx Interrupt Enable Register">
        <bitfield id="UCRXIE" description="Receive interrupt enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="UCRXIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCRXIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCTXIE" description="Transmit interrupt enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="UCTXIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCTXIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
    </register>
